Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.UneditableFabricationPartNotReposition
Failed to reposition part.

Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.SizeNotAvailableInFabricationService
Sizes:%1!s! in system %2!s! are not available in fabrication service:%3!s!, All available sizes are:\n%4!s!.

Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.PlaceCutinFittingFailed
Failed to insert part.

Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.PinnedFabricationPartNotReposition
Failed to reposition part.

Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.PinnedFabricationPartNotChangeExtension
Failed to change extension of part.

Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.NotAllPartsWereConvertedUnsuportedFittingOffsets
Not all parts were converted. Eccentric transitions and taps that have offsets from the center line are unsupported and cannot be converted.

Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.NoStructuralHostToAttachWarning
There is no structural component to attach the hanger rod to.

Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.InvalidSelectionThereCannotBeOpenConnectors
Invalid selection there cannot be any open connectors for the design to fabrication part tool.

Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.InvalidConnectionsHaveBeenDisconnected
Invalid connections have been disconnected. Please reconnect them manually or use different fittings.

Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.HangerWidthOutOfRange
The hanger width is too large to show.

Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.HangerProfileNotMatchWithHost
The defined hanger profile does not match with the host.

Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.GroupedFabricationPartNotReposition
Failed to reposition part.

Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FixedFabricationPartNotChangeLength
Failed to change length of fixed part.

Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationStraigtLengthOversized
Fabrication straight exceeds the standard length. Use the Optimize Length command to adjust the length.

Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationServiceMismatch
Attempting to connect fabrication parts from different services.

Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationRodsDisconnectedWarning
The hanger rod was disconnected because there is no structural component above.

Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationRodsDisconnectedError
The hanger rod was disconnected because there is no structural component above.

Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationRodsConnectionChangedWarning
The structural component that the hanger is attached to has changed to a different element.

Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationRodDetachFromHangerError
The rod need to be detached from hanger.

Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationPartOptimizeInvalidConnection
No available couplings to connect standard lengths for this instance of straight.

Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationPartNotAttachedToStraight
The part must be attached to straight.

Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationPartNoPartTypeFound
There are no fabrication part types found for the current Configuration and Service. Please select settings and reload the service to create the fabrication part types.

Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationPartInvalidSpecification
The part specification is invalid.

Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationPartInvalidConnection
Fabrication Part connection invalid and could not be automatically coupled.

Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationPartHasInvalidGeometry
The fabrication part either has no material or has badly configured dimensions, resulting in bad geometry.

Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationPartFitFailure
Fabrication Part Fitting Failed to Fit

Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationPartFitFailWarning
Fabrication Part Fitting Failed to Fit

Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationPartCannotChangeTypeWarning
The selected fitting(s) cannot maintain connections to existing fabrication parts due to size, direction or angle differences. You must manually reconnect the open connections.

Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationPartCannotChangeTypeUnConnError
The selected fitting(s) cannot successfully change the type.

Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationPartCannotChangeTypeMisalignedUnConnError
The selected fitting(s) cannot successfully change the type. The newly selected fabrication part type has a problem with the angle dimension of the current fitting(s), resulting in bad geometry.

Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationPartCannotChangeTypeMisalignedError
The selected fitting(s) cannot successfully change the type. The newly selected fabrication part type has a problem with the angle dimension of the current fitting(s), resulting in bad geometry. You may try to disconnect the connections on the fitting(s) and try again.

Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationPartCannotChangeTypeIncompatUnConnError
The selected fitting(s) cannot successfully change the type. The newly selected fabrication part type either has no material or has badly configured dimensions, resulting in bad geometry.

Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationPartCannotChangeTypeIncompatError
The selected fitting(s) cannot successfully change the type. The newly selected fabrication part type either has no material or has badly configured dimensions, resulting in bad geometry. You may try to disconnect the connections on the fitting(s) and try again.

Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationPartCannotChangeTypeError
The selected fitting(s) cannot successfully change the type. You must disconnect the connections on the fitting(s) and try again.

Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationPartCannotChangeTypeBadDimUnConnError
The selected fitting(s) cannot successfully change the type. The newly selected fabrication part may have badly configured dimensions, resulting in bad geometry.

Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationPartCannotChangeTypeBadDimError
The selected fitting(s) cannot successfully change the type. The newly selected fabrication part may have badly configured dimensions or be constrained due to connected fitting(s). You may try to disconnect the connections on the fitting(s) and try again.

Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationPartCannotChangeSlopeError
The connected fitting(s) cannot successfully change to the new slope value. You may try to disconnect the connections on the fitting(s) and try again.

Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationPartCannotChangeServiceSizeWarning
The selected fitting(s) cannot successfully change service or change size. You must disconnect the connections on the fitting(s) and try again.

Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationOverSizedCheck
Fabrication part is too large to fit on the sheet metal. Replace the part with multiple smaller parts, or notify the CAM operator.

Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationOutOfSizeCondition
The fabrication part size is not within the correct size range for the service button condition.

Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationHangerSizeNotMatch
The hanger size does not match the size of the host, so it can not be connected.

Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationHangerOutOfHost
The hanger is out of its host and will be disconnected.

Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationHangerNotConnectToHost
Fabrication Hanger didn't connect to the %s host.

Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationHangerHostNotFound
The hanger will disconnect because we can't find the suitable host.

Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationHangerCannotBeSloped
A hanger cannot be sloped or placed on a sloped element.

Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationConfigurationCorrupted
It looks that the Fabrication Configuration %1!s! was corrupted, please check it at %2!s!.

Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabDbSwapOut
Fabrication Database reload could not swap out for newer parts.

Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabDbOpenJobConn
Fabrication job imported had bad connectivity

Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabDbChangeConn
Fabrication Database changes altered connectivity

Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.CannotMatchFabricationHangerSizeToHost
The hanger cannot be re-sized to match the re-sized host.

Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.CannotConvertFlexPipeToPart
Cannot convert flex pipe to fabrication part.

Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures
Failures about MEP fabrication.